#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
azurerm_service_plan.serviceplan: Refreshing state... [id=/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/langchain-experiments/providers/Microsoft.Web/serverfarms/serviceplan]
data.azurerm_client_config.current: Reading...
azurerm_resource_group.LangChain-Experiments: Refreshing state... [id=/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1kNmY5YzUwOS04YWFkLTQ4MjctYWY4ZS0yYzc2ZWFmNzEwYWE7b2JqZWN0SWQ9MTI4NWFhOTktNTliMi00ZWViLWEyOTktYzVlNTY0NDVjZmUxO3N1YnNjcmlwdGlvbklkPTEyZDg2MDcyLTAzNmMtNGNkZS05YjY1LTVkNzU2MDE2NTM4Njt0ZW5hbnRJZD01NDY5ZDEzNy0zNDlmLTQwNjAtYjgwNy1mZWYzYjQ5MjgxMmI=]
azurerm_redis_cache.bot-cache: Refreshing state... [id=/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.Cache/redis/LangChain-Experiments]
azurerm_storage_account.gnwosutfstatestorageacc: Refreshing state... [id=/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.Storage/storageAccounts/gnwosutfstatestorageacc]
azurerm_linux_web_app.slackbotwebapp: Refreshing state... [id=/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.Web/sites/slackbotwebapp]
azurerm_storage_container.gnwosutfstatestoragecont: Refreshing state... [id=https://gnwosutfstatestorageacc.blob.core.windows.net/gnwosutfstatestoragecont]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_cognitive_account.slackbot_synth will be created
  + resource "azurerm_cognitive_account" "slackbot_synth" {
      + endpoint                           = (known after apply)
      + id                                 = (known after apply)
      + kind                               = "SpeechServices"
      + local_auth_enabled                 = true
      + location                           = "westeurope"
      + name                               = "slackbot-synth"
      + outbound_network_access_restricted = false
      + primary_access_key                 = (sensitive value)
      + public_network_access_enabled      = true
      + resource_group_name                = "LangChain-Experiments"
      + secondary_access_key               = (sensitive value)
      + sku_name                           = "F1"
    }

  # azurerm_key_vault.slackbot_secrets will be created
  + resource "azurerm_key_vault" "slackbot_secrets" {
      + access_policy                 = [
          + {
              + key_permissions    = [
                  + "Get",
                  + "List",
                ]
              + object_id          = "1285aa99-59b2-4eeb-a299-c5e56445cfe1"
              + secret_permissions = [
                  + "Get",
                  + "List",
                ]
              + tenant_id          = "5469d137-349f-4060-b807-fef3b492812b"
            },
        ]
      + id                            = (known after apply)
      + location                      = "westeurope"
      + name                          = "slackbot-secrets"
      + public_network_access_enabled = true
      + purge_protection_enabled      = true
      + resource_group_name           = "LangChain-Experiments"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 90
      + tenant_id                     = "5469d137-349f-4060-b807-fef3b492812b"
      + vault_uri                     = (known after apply)
    }

  # azurerm_key_vault_secret.slackbot_synth_endpoint will be created
  + resource "azurerm_key_vault_secret" "slackbot_synth_endpoint" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "slackbot-synth-endpoint"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.slackbot_synth_primary_access_key will be created
  + resource "azurerm_key_vault_secret" "slackbot_synth_primary_access_key" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "primary-access-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_linux_web_app.slackbotwebapp will be updated in-place
  ~ resource "azurerm_linux_web_app" "slackbotwebapp" {
        id                                = "/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.Web/sites/slackbotwebapp"
        name                              = "slackbotwebapp"
      ~ service_plan_id                   = "/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/LangChain-Experiments/providers/Microsoft.Web/serverfarms/serviceplan" -> "/subscriptions/12d86072-036c-4cde-9b65-5d7560165386/resourceGroups/langchain-experiments/providers/Microsoft.Web/serverfarms/serviceplan"
        tags                              = {}
        # (17 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 4 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
```

</details>

*Pusher: @gregnwosu, Action: `pull_request`, Working Directory: ``, Workflow: `Build and deploy Python app to Azure Web App - slackbotwebapp`*